
/***********************************************************************
*
*  
*
*  @file       compare_pic.cpp
*  @brief      主要处理输入与输出
*
*
*  @author     马飞鹏
*  @email      767102280@qq.com
*  @version    1.0.0
*  @date       2018/10/14
*
*
*  ------------------------------------------------------------
*  修改历史：
*  ------------------------------------------------------------
*  <日期>    |  <版本> |  <作者>  |  <描述>
*  ------------------------------------------------------------
*  2018/10/14 |  1.0.0  |  马飞鹏  | 创建文件
*  ------------------------------------------------------------
*/

#include "compare_pic.h"



/*
 * @brief  该函数用来比较图像的位置横坐标大小
 * @param  输入要比较的两个矩形
 * @retval 布尔变量
 *
 */
bool cmp(const Rect& a,const Rect &b)
{
	if(a.x<b.x)
		return true;
	else
		return false;

}

